AV1881*   CHECK IF PSOT-SOC-ONLY-ACCM, THEN CHECK PPFR-RWD-BY-TRAN-IND
AV1881*   AND PSOT-RWD-BY-TRAN-IND = 'Y'
AV1881     IF PSOT-SOC-ONLY-ACCM = 'Y' AND PSOT-RWD-BY-TRAN-IND = 'N'
AV1881       SET WS-NOT-CHILD-OFFER           TO TRUE
AV1881       INITIALIZE BSTPSO3-TABLE
AV1881       MOVE PSOT-OFFER-CODE             TO PSO3-OFFER-CODE
AV1881       MOVE  5                          TO TBCA-FG-KEY-LENGTH
AV1881       SET  TBCA-FETCH-GENERIC          TO TRUE
AV1881       PERFORM 8302-READ-PSO3-TABLE THRU 8302-EXIT
AV1881       IF TBCA-NOT-FOUND
AV1881         PERFORM VARYING WS-I FROM 1 BY 1 UNTIL
AV1881           WS-I > CHI-TBL-SUB OR WS-CHILD-OFFER
AV1881           IF PSOT-OFFER-CODE = WS-CHILD-SOC (WS-I)
AV1881             MOVE WS-CHILD-PRMO (WS-I) TO PSO3-PRMO-ID
AV1881             MOVE 0                    TO WS-CHILD-SOC(WS-I)
AV1881             SET WS-CHILD-OFFER TO TRUE
AV1881             SET TBCA-FOUND     TO TRUE
AV1881           END-IF
AV1881         END-PERFORM
AV1881       END-IF
AV1881       IF TBCA-FOUND OR WS-CHILD-OFFER
AV1881         MOVE PSO3-PRMO-ID TO PPFR-PRMO-ID
AV1881         PERFORM 2180-VALIDATE-PPFR THRU 2180-EXIT
AV1881       END-IF
AV1881     END-IF.

...

AV1881*=================*
AV1881 2180-VALIDATE-PPFR.
AV1881*=================*
AV1881     PERFORM 8030-READ-FEATURES-TABLE THRU 8030-EXIT
AV1881
AV1881     IF TBCA-NOT-FOUND
AV1881          GO TO 2180-EXIT
AV1881     ELSE
AV1881       IF PPFR-RWD-BY-TRAN-IND = 'Y'
AV1881         MOVE 'Y' TO WS-DATABASE-ERROR
AV1881         ADD 1 TO WS-ERROR-CTR
AV1881         MOVE SPACES                   TO DETAIL-1
AV1881         MOVE PSOT-OFFER-CODE          TO D1-OFFER-CODE
AV1881         MOVE 'PSOT-RWD-BY-TRAN-IND'   TO D1-CODE
AV1881         MOVE PSOT-RWD-BY-TRAN-IND     TO D1-KEY1
AV1881         MOVE PPFR-PRMO-ID             TO D1-KEY2
AV1881         MOVE 'PROMO ID HAS RBT TURNED ON FOR A NON-RBT SOC'
AV1881                                       TO D1-DESC
AV1881         WRITE ERROR-REC FROM DETAIL-1
AV1881           ADD 1 TO WS-LINE-CNT
AV1881       END-IF
AV1881     END-IF
AV1881
AV1881     MOVE PSO3-PRMO-ID                 TO WS-N
AV1881     IF WS-CHILD-OFFER
AV1881       SET TBCA-NOT-FOUND TO TRUE
AV1881       PERFORM VARYING WS-I FROM 1 BY 1 UNTIL
AV1881         WS-I > CHI-TBL-SUB OR TBCA-FOUND
AV1881         IF PSOT-OFFER-CODE = WS-CHILD-SOC (WS-I)
AV1881           MOVE 0                      TO WS-CHILD-SOC(WS-I)
AV1881           IF WS-CHILD-PRMO (WS-I) NOT = PSO3-PRMO-ID
AV1881             MOVE WS-CHILD-PRMO (WS-I) TO PSO3-PRMO-ID
AV1881             SET TBCA-FOUND TO TRUE
AV1881           END-IF
AV1881         END-IF
AV1881       END-PERFORM
AV1881     ELSE
AV1881       PERFORM UNTIL WS-N NOT = PSO3-PRMO-ID OR TBCA-NOT-FOUND
AV1881         SET TBCA-GET-NEXT               TO TRUE
AV1881         PERFORM 8302-READ-PSO3-TABLE    THRU 8302-EXIT
AV1881       END-PERFORM
AV1881     END-IF
AV1881     IF TBCA-NOT-FOUND
AV1881       GO TO 2180-EXIT
AV1881     ELSE
AV1881       PERFORM 8030-READ-FEATURES-TABLE THRU 8030-EXIT
AV1881
AV1881       IF TBCA-FOUND
AV1881         IF PPFR-RWD-BY-TRAN-IND = 'Y'
AV1881           MOVE 'Y' TO WS-DATABASE-ERROR
AV1881           ADD 1 TO WS-ERROR-CTR
AV1881           MOVE SPACES                   TO DETAIL-1
AV1881           MOVE PSOT-OFFER-CODE          TO D1-OFFER-CODE
AV1881           MOVE 'PSOT-RWD-BY-TRAN-IND'   TO D1-CODE
AV1881           MOVE PSOT-RWD-BY-TRAN-IND     TO D1-KEY1
AV1881           MOVE PPFR-PRMO-ID             TO D1-KEY2
AV1881           MOVE 'PROMO ID HAS RBT TURNED ON FOR A NON-RBT SOC'
AV1881                                         TO D1-DESC
AV1881           WRITE ERROR-REC FROM DETAIL-1
AV1881             ADD 1 TO WS-LINE-CNT
AV1881       END-IF
AV1881     END-IF.
AV1881 2180-EXIT.
AV1881     EXIT.
      
